DROP TABLE IF EXISTS quotes;

CREATE TABLE quotes (
  id INT AUTO_INCREMENT PRIMARY KEY,
  date DATE NOT NULL,
  stock VARCHAR(50) NOT NULL,
  price INT(50) NOT NULL
);

INSERT INTO quotes (date, stock, price) VALUES
  ('2019-01-01', 'Газпром', 2000),
  ('2019-01-01', 'Автоваз', 2500),
  ('2019-01-02', 'Газпром', 1000),
  ('2019-01-02', 'Автоваз', 2900),
  ('2019-01-03', 'Газпром', 2500),
  ('2019-01-03', 'Автоваз', 3900),
  ('2019-01-04', 'Газпром', 1500),
  ('2019-01-04', 'Автоваз', 5000),
  ('2019-01-05', 'Газпром', 3000),
  ('2019-01-05', 'Автоваз', 1000),
  ('2019-01-06', 'Газпром', 2500),
  ('2019-01-06', 'Автоваз', 3900),
  ('2019-01-07', 'Газпром', 3500),
  ('2019-01-07', 'Автоваз', 3900),
  ('2019-01-08', 'Газпром', 4000),
  ('2019-01-08', 'Автоваз', 1000),
  ('2019-01-09', 'Газпром', 3500),
  ('2019-01-05', 'Сбербанк', 10000),
  ('2019-01-10', 'Газпром', 2500),
  ('2019-10-07', 'Автоваз', 2100),
  ('2019-10-09', 'Газпром', 3500);
